EDT/УТ/src/Documents/упрЗагрузкаДанныхОПлатежахИзБП/упрЗагрузкаДанныхОПлатежахИзБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>упрЗагрузкаДанныхОПлатежахИзБП</name>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхБазы1С</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПлатежныеПоручения</name>
    <attributes>
      <name>ПлатежноеПоручение</name>
      <type>
        <types>DocumentRef.упрПлатежноеПоручение</types>
      </type>
    </attributes>
    <attributes>
      <name>Выписка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПлатежа</name>
      <type>
        <types>EnumRef.упрСостоянияПлатежей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/упрСостоянияПлатежей/упрСостоянияПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>упрСостоянияПлатежей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеПлатежа</name>
    <type>
      <types>EnumRef.упрСостоянияПлатежей</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.упрЗагрузкаДанныхОПлатежахИзБП</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Платеж</name>
    <type>
      <types>DocumentRef.упрПлатежноеПоручение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/упрЗагрузкаДанныхОПлатежахИзБП/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.упрСостоянияПлатежей КАК упрСостоянияПлатежей
	|ГДЕ
	|	упрСостоянияПлатежей.ДокументРегистратор = &Ссылка";
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Сейчас = ТекущаяДата();
	
	Для Каждого СтрокаПП Из ПлатежныеПоручения Цикл
		ЗаписьРегистра = РегистрыСведений.упрСостоянияПлатежей.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Период = Сейчас;
		ЗаписьРегистра.Платеж = СтрокаПП.ПлатежноеПоручение;
		ЗаписьРегистра.СостояниеПлатежа = СтрокаПП.СостояниеПлатежа;
		ЗаписьРегистра.ДокументРегистратор = Ссылка;
		ЗаписьРегистра.Записать();
	КонецЦикла;
	
КонецПроцедуры
